<?php

/*УМОВА - Підрахуйте кількість слів у довільному тексту. Використовувати можна ЛИШЕ ЦИКЛИ,
без функцій для рядків або масивів (окрім substr (mb_substr) або strlen (mb_strlen)).
На що орієнтуватись? На пробіли між словами. Але зауважте:
У тексті може бути декілька пробілів поспіль; цю ситуацію треба передбачити;*/


$text = '  PHP        поддерживает  ,     концепцию переменных функций    !  ';

$text_count = mb_strlen($text);   // количество символов (кириллицы)
$sum_total_text = 0;
$q = 0;

for ($i = 0; $i < $text_count; ++$i) {
    if (mb_substr($text, $i, 1) == ' '){
        if ($q > 0){
            $sum_total_text++;
            $q = 0;
        }
        continue;
    }
    if (($q == 0) && (mb_substr($text, $i, 1) == '!') || (mb_substr($text, $i, 1) == ','))
  {continue;}           // можно дополнительно добавить знаки которые мы хотим проигнорировать (не считаем за слово)
    $q++;
}

echo 'Кількість слів - '.$sum_total_text.PHP_EOL;   // выводим сумму слов

